In [1]:
import pandas  as pd
data = pd.read_csv("../Dataset/random/dataset.csv")
data[data['Score'] > 90]

  Employee Department Quarter  Score
2     John         IT      Q1     92
4    David      Sales      Q2     95
8     Neha      Sales      Q3     99

In [2]:
data[data['Score'] > 90]

  Employee Department Quarter  Score
2     John         IT      Q1     92
4    David      Sales      Q2     95
8     Neha      Sales      Q3     99

In [3]:
data[data["Department"] == "Sales"]

  Employee Department Quarter  Score
0     Amit      Sales      Q1     78
4    David      Sales      Q2     95
8     Neha      Sales      Q3     99

In [4]:
data.sort_values("Employee")

  Employee Department Quarter  Score
6     Alex         IT      Q2     70
0     Amit      Sales      Q1     78
4    David      Sales      Q2     95
2     John         IT      Q1     92
9    Karan         IT      Q3     76
5    Meera         HR      Q2     80
8     Neha      Sales      Q3     99
1    Priya         HR      Q1     85
7     Ravi    Finance      Q2     90
3     Sara    Finance      Q1     88

In [5]:
data.sort_values('Score', ascending=False)

  Employee Department Quarter  Score
8     Neha      Sales      Q3     99
4    David      Sales      Q2     95
2     John         IT      Q1     92
7     Ravi    Finance      Q2     90
3     Sara    Finance      Q1     88
1    Priya         HR      Q1     85
5    Meera         HR      Q2     80
0     Amit      Sales      Q1     78
9    Karan         IT      Q3     76
6     Alex         IT      Q2     70

In [6]:
data.groupby("Department")["Score"].mean()

Department
Finance    89.000000
HR         82.500000
IT         79.333333
Sales      90.666667
Name: Score, dtype: float64

In [7]:
data.groupby("Quarter")["Score"].max()

Quarter
Q1    92
Q2    95
Q3    99
Name: Score, dtype: int64